import React, { useState } from 'react';
import {
    StyleSheet,
    Text,
    View,
    ScrollView,
    TouchableOpacity,
    StatusBar,
} from 'react-native';
// import mainStyle from '../assets/style/style';
import MainStyle from '../components/styles/MainStyle';

export default function Condition({ tocHandler }) {
    // const [tocHandler, settocHandler] = useState(false)
    return (
        <View style={MainStyle.mainContainer}>
            {/* <MainHeader headerLabel={'ҮЙЛЧИЛГЭЭНИЙ НӨХЦӨЛ'} showNotification={false} {...this.props} isGoBack={true} /> */}
            <View style={condition.conditionContent}>
                <ScrollView style={{ marginBottom: 0 }}>
                    <View style={condition.contentContainer}>
                        <Text style={[MainStyle.txtFormTitle, { marginBottom: 15, fontSize: 14 }]}>{'Цахим зээлийн үйлчилгээний нөхцөл'.toUpperCase()}</Text>
                        <Text style={condition.subParagraphText}>Энэхүү цахим зээлийн үйлчилгээний нөхцөл нь Харилцагч Монголиа Импакт Финанс ББСБ ХХК-иас Кю-мони цахим зээлийн платформоор дамжуулан цахим зээлийн үйлчилгээ авахтай холбоотойгоор талуудын хоорондын харилцааг зохицуулах суурь баримт бичиг болно. Цахим зээлийн үйлчилгээний нөхцөл нь Кю-мони цахим зээлийн платформ Харилцагчийн үүсгэсэн, илгээсэн тодорхой мэдээллийг хадгалах, уг цахим зээлийн үйлчилгээний нѳхцѳлд заасан зорилгоор ашиглах, түүнд боловсруулалт хийх эрхийг олгох эрх зүйн үр дагавар бүхий хууль зүйн баримт бичиг юм. Кю-мони цахим зээлийн платформын зүгээс харилцагчийн бүртгүүлсэн гар утсанд илгээх 6 оронтой баталгаажуулах кодыг баталгаажуулах код хэсэгт оруулан үйлчилгээний нѳхцѳлтэй танилцан зѳвшѳѳрѳх товчыг дарснаар харилцагч уг цахим зээлийн үйлчилгээний нѳхцѳлийг хүлээн зѳвшѳѳрч гарын үсэг зурсан гэж үзнэ.</Text>
                        <View style={condition.conditionContentParagraph}>
                            <Text style={condition.paragraphNum}>Нэг. Нэр томьёо</Text>
                            <Text style={condition.paragraphText}>{`1.1. Энэхүү цахим зээлийн үйлчилгээний нөхцөлд хэрэглэсэн нэр томьёог дараах утгаар ойлгоно.\n
                                \n1.1.1. “ББСБ” гэж цахим зээлийн үйлчилгээ үзүүлэгч буюу Монголиа Импакт Финанс ББСБ ХХК-ийг;
                                \n1.1.2. “Харилцагч” гэж Монголиа Импакт Финанс ББСБ ХХК-иас үзүүлж буй цахим зээлийн үйлчилгээг ашиглах хүсэлтэй хувь хүнийг;
                                \n1.1.3. “Аппликэйшн” гэж дэвшилтэт технологи ашиглан хэрэглэгч ухаалаг гар утсанд татаж авч, харилцагчаар бүртгүүлэн зээл авах ББСБ-ын цахим програм хангамжийг;
                                \n1.1.4. “Вебсайт” гэж хэрэглэгч харилцагчаар бүртгүүлэн, цахим зээлийн үйлчилгээ авах ББСБ-ын  www.Qmoni.mn хаягтай вебсайтыг;
                                \n1.1.5. “Kю-мони цахим зээлийн платформ” буюу “Цахим зээлийн платформ” гэж ББСБ-аас үзүүлж байгаа цахим зээлийн үйлчилгээг гүйцэтгэх аппликэйшн болон вебсайтыг хамтад нь. Аппликэйшн болон вебсайт нь бие биеэ орлох боломжтой бөгөөд үзүүлэх цахим зээлийн үйлчилгээ болон үйлчилгээний нөхцөл нэг байна;
                                \n1.1.6. “Кю-мони цахим зээлийн үйлчилгээ” буюу “Цахим зээлийн үйлчилгээ гэж” ББСБ-аас Кю-мони цахим зээлийн платформоор дамжуулан Харилцагчид үзүүлж буй цахим зээлийн үйлчилгээг. `}</Text>
                        </View>
                        <View style={condition.conditionContentParagraph}>
                            <Text style={condition.paragraphNum}>Хоёр. Харилцагчид тавих шаардлага</Text>
                            <Text style={condition.paragraphText}>{`2.1. Kю-мони цахим зээлийн үйлчилгээний харилцагч нь дараах нийтлэг шаардлагыг хангасан хувь хүмүүс байна. Үүнд:
                                \n2.1.1. 18 нас хүрсэн Монгол улсын иргэн байх;
                                \n2.1.2. Цахим шуудангийн хаяг буюу и-мэйл хаягтай байх;
                                \n2.1.3. Фейсбүүк хаягтай байх;
                                \n2.1.4. Ухаалаг гар утастай байх;
                                \n  2.1.4.1. IOS үйлдлийн системийн 8.0 үзүүлэлттэй iPhone 4S болон түүнээс дээш загварын гар утас; 
                                \n  2.1.4.2. Android үйлдлийн системийн 4.1 болон түүнээс дээш үзүүлэлттэй LG, SAMSUNG, HTC гэх мэт загварын гар утас.
                                \n2.1.5. Дотоодын аль нэг банканд төгрөгийн данстай бөгөөд тухайн дансандаа интернэт банкны эрхтэй байх;
                                \n2.2. Зээлдэгч нь 2.1 дэх хэсэгт заасан нийтлэг шаардлагаас гадна дараах шаардлагыг хангасан байна. Үүнд:
                                \n  2.2.1. Тогтмол орлоготой байх;
                                \n  2.2.2. Банк, санхүүгийн байгууллагад чанаргүй зээлийн үлдэгдэлгүй байх;`}</Text>
                        </View>
                        <View style={condition.conditionContentParagraph}>
                            <Text style={condition.paragraphNum}>Гурав. Харилцагчийн бүртгэл, зээлийн эрх</Text>
                            <Text style={condition.paragraphText}>{`3.1. Шаардлага хангасан харилцагч нь цахим зээлийн платформууд болох вебсайт болон аппликэйшны аль хүссэнээрээ хандан “Бүртгүүлэх” цэсрүү орж өөрийн бүртгэлтэй гар утасны дугаарыг хийн 6 оронтой баталгаажуулах кодыг авч бүртгэлийг цааш үргэлжлүүлнэ. Ийнхүү бүртгүүлснээр шууд Зээл авах эрх нээгдэхгүй.
                                \n3.2. Харилцагч нь Зээл авах эрхийг нээх эсэхийг шийдвэрлэхэд ач холбогдол бүхий “Харилцагчийн мэдээлэл” хэсэгт дурдсан дараах мэдээллээ Монголиа Импакт Финанс ББСБ ХХК-д сайн дураар өгч байгаа болно. Үүнд:
                                \n  3.2.1. Ургийн овог, овог, нэр;
                                \n  3.2.2. Регистрийн дугаар;
                                \n  3.2.3. Цахим шуудангийн хаяг (И-мэйл хаяг);
                                \n  3.2.4. Гэрэлсэн эсэх мэдээлэл;
                                \n  3.2.5. Өрхийн амьдарч буй сууц;
                                \n  3.2.6. Амьдарч буй сууц өөрийн эсэх;
                                \n  3.2.7. Хувьдаа автомашинтай эсэх;
                                \n  3.2.8. Одоо ажиллаж байгаа байгууллагын нэр;
                                \n  3.2.9. Оршин суугаа хаяг;
                                \n  3.2.10. Яаралтай үед холбоо барих хүний нэр, утасны дугаар;
                                \n  3.2.11. Сарын орлогын хэмжээ;
                                \n  3.2.12. Зээлтэй бол сарын төлөлтийн хэмжээ;
                                \n  3.2.13. Иргэний үнэмлэхний зураг оруулах;
                                \n  3.2.14. Өөрийн фэйсбүүк хаяг холбох;
                                \n  3.2.15. Өөрийн интернет банкны дансаа холбох; 
                                `}</Text>
                            <Text style={condition.paragraphText}>3.3 ББСБ нь дээрх харилцагчийн мэдээллийг ашиглан харилцагчийн зээлийн түүхийг Монголбанкны Зээлийн мэдээллийн сангаас татах, холбосон интернет банкны дансны хуулгыг 1 удаа авах зэргээр мэдээллийн боловсруулалтыг хийснээр тухайн харилцагчид зээл авах эрх нээх эсэх болон зээлийн эрхийн хэмжээг тодорхойлно.</Text>
                            <Text style={condition.paragraphText}>{`\n3.4. Харилцагч нь зээл авах эрх нээгдсэн эсэх болон зээлийн эрхийн хэмжээгээ Кю-мони цахим зээлийн платформууд болох аппликэйшн болон вебсайтаар нэвтрэн орсноор мэдэх боломжтой.`}</Text>
                            <Text style={condition.paragraphText}>{`\n3.5. Харилцагч нь өөрийн мэдээллийг үнэн зөв, бүрэн гүйцэд бөглөх үүрэгтэй. Харилцагч нь аливаа мэдээллийг санаатай болон санамсаргүйгээр алдаатай бөглөсний улмаас ББСБ-д учирсан хохирлыг бүрэн хариуцаж, үл маргах журмаар нөхөн төлнө.`}</Text>
                            <Text style={condition.paragraphText}>{`\n3.6. Харилцагч нь өөрийн бүртгэлтэй гар утасны дугаар, и-мэйл хаяг, данс зэрэг аливаа мэдээлэлд орсон өөрчлөлтийг тухай бүрт (тухайн өдөрт нь багтаан) шинэчлэн бүртгүүлнэ. Харилцагч нь энэхүү үүргээ биелүүлээгүйн улмаас өөрт болон ББСБ-д учирсан хохирлыг дангаар бүрэн хариуцна.`}</Text>
                        </View>
                        <View style={condition.conditionContentParagraph}>
                            <Text style={condition.paragraphNum}>Дөрөв. Үйлчилгээний нөхцөл</Text>
                            <Text style={condition.paragraphText}>{`4.1. Цахим зээлийн үйл ажиллагааг гүйцэтгэх үндсэн платформ нь Кю-мони ухаалаг гар утасны аппликэйшн болон www.Qmoni.mn вебсайт байна.
                                \n4.2. Кю-мони цахим зээлийн платформд бүртгэлтэй хэрэглэгч нь  24/7 буюу 7 хоногийн бүх өдрүүдэд, хоногийн 24 цагийн горимд шаардлагатай үедээ аппликэйшн болон вебсайтыг ашиглан дараах үйлдлийг хийх эрхтэй:
                                \n  4.2.1. Цахимаар зээлийг өөрийн банкны дансанд хүлээн авах;
                                \n  4.2.4. Зээл төлөх;
                                \n4.3. ББСБ нь харилцагчийн хувийн мэдээлэл, санхүүгийн мэдээлэл, зээлийн мэдээллийн сангаас авсан мэдээллүүд дээр үндэслэн дүн шинжилгээ хийн, үнэн зөвийг шалган тухайн харилцагчийн зээлийн эрх нээх эсэх болон зээлжих оноог тодорхойлно.
                                \n4.4. Харилцагч нь түүний өгсөн аливаа мэдээ мэдээллийг Цахим зээлийн эрх нээх эсэх болон зээлжих оноог тогтоохтой холбоотойгоор дараах зорилгоор хэрэглэх зөвшөөрлийг Монголиа Импакт Финанс ББСБ ХХК-д олгож байна. Үүнд:
                                \n  4.4.1. Харилцагчийн үүсгэсэн, илгээсэн хувийн болон сахүүгийн мэдээллийг хүлээн авч хадгалах; 
                                \n  4.4.2. Харилцагчийн Цахим зээлийн эрх нээх гэрээний төслийг боловсруулахад ашиглах;
                                \n  4.4.3. Зээлжих оноог тогтоох болон зээлийн эргэн төлөлт хэвийн байх эсэхэд хяналт тавих зорилгоор түүний регистрийн дугаарыг ашиглан зээлийн түүхийг Зээлийн мэдээллийн сангаас татан авах;
                                \n  4.4.4. Харилцагчийн зээлжих оноог сайжруулах зорилгоор хандалтын түүх, зээлийн төлөлт нь системд хадгалагдах;
                                \n  4.4.5. Үйлчилгээний чанар, нөхцөлийг сайжруулахтай холбоотой дотоодын хэрэгцээнд ашиглах;
                                \n  4.4.6. Харилцагчийн холбосон интернет банкны дансны хуулгыг авах ба тус хуулгыг харилцагчийн зээлжих оноог тогтоох зорилгоор 1 удаа ашиглана.
                                `}</Text>
                        </View>
                        <View style={condition.conditionContentParagraph}>
                            <Text style={condition.paragraphNum}>Тав. Үйлчилгээний шимтгэл, хүү болон төлбөр тооцооны нөхцөл</Text>
                            <Text style={condition.paragraphText}>{`5.1. Цахим зээлийн шимтгэл, хүүгийн хэмжээг ББСБ-ын зүгээс тогтооно.
                                \n5.2. Цахим зээлийн шимтгэлийн мэдээллийг аппликэйшн болон вебсайтаар дамжуулан хэрэглэгчид мэдэгдэнэ.
                                \n5.3. Зээлийн шимтгэл, хураамжийг ББСБ-аас хэдийд ч өөрчилж, шинэчлэх эрхтэй. Энэ тохиолдолд олон нийтэд аппликэйшнээр дамжуулан ил тод байдлаар мэдээлэх бөгөөд эдгээр өөрчлөлтүүд нь МУ-ын хууль тогтоомжийн бусад акт, холбогдох эрх бүхий байгууллагаас гаргасан журамд нийцсэн, харилцагчид хохиролгүй байна.
                                `}</Text>
                        </View>
                        <View style={condition.conditionContentParagraph}>
                            <Text style={condition.paragraphNum}>Зургаа. Харилцагчийн эрх, үүрэг</Text>
                            <Text style={condition.paragraphText}>{`6.1. Харилцагч дараах эрхтэй:
                                \n  6.1.1. Цахимаар зээл авах;
                                \n  6.1.2. Цахим зээлийн үйлчилгээний эрхээ түр хаалгах, сэргээлгэх, цуцлах;
                                \n  6.1.3. Цахим зээлийн үйлчилгээний талаар гомдол, саналаа шийдүүлэх;
                                \n  6.1.4. ББСБ-ын үйл ажиллагааны журамтай танилцах, өөрт холбогдох дансны хуулга болон мэдээллийг гаргуулах;
                                \n  6.1.5. Өөрийн цахим зээлийн гүйлгээний талаарх мэдээллийг гүйлгээ хийгдсэн тухай бүр гар утсандаа мессеж хэлбэрээр хүлээн авах;
                                \n  6.1.6. Үйлчилгээний гарын авлага авах, дуудлагын төв, үйлчилгээний вэб хуудсаар үйлчилгээний мэдээлэл авах, үйлчилгээний болон системийн өөрчлөлттэй холбоотой мэдээллийг түргэн шуурхай хүлээн авах;
                                \n  6.1.7. Үйлчилгээтэй холбоотой мэдээлэл, лавлагааг ББСБ-ын лавлах утаснаас дурын үед авах боломжоор хангагдах;
                                \n  6.1.8. Цахим зээлийн үйлчилгээний нөхцөлөөр хүлээсэн үүргээ биелүүлэхийг ББСБ-аас шаардах;
                                \n  6.1.9. Хууль тогтоомжид заасан бусад эрх.
                                \n6.2. Харилцагч дараах үүрэгтэй.
                                \n  6.2.1. ББСБ-д өөрт холбогдолтой мэдээллийг үнэн зөв, бүрэн өгөх;
                                \n  6.2.2. Харилцагч нь өөрийн аппликэйшн, вебсайт-д хандах нэвтрэх нэр, нууц үгийг чандлан хадгалах бөгөөд аливаа гуравдагч этгээдэд дамжуулахгүй байх;
                                \n  6.2.3. Харилцагч нь цахим зээлийн үйлчилгээний платформ (Кю-мони гар утасны аппликэйшн, www.Qmoni.mn вебсайт)-д нэвтрэх өөрийн бүртгэлийн нэр болон нууц үгийн нууцлалыг өөрийн эцэг эх, эхнэр/нөхөр, хүүхэд болон бусад этгээдэд санаатай болон санамсаргүй байдлаар задруулсны улмаас үүсэх үр дагаврыг дангаар бүрэн хариуцах;
                                \n  6.2.4. Харилцагч нь цахим зээлийн үйлчилгээ авахтай холбоотойгоор өөрийн интернет банкны нэвтрэх мэдээллийг 1 удаа оруулж, системээс дансны хуулгыг амжилттай авсны дараа нэн даруй өөрийн тухайн интернет банкны нэвтрэх нэр, нууц үгийг солих үүрэгтэй бөгөөд энэхүү үүргээ биелүүлээгүйгээс үүссэн аливаа үр дагаврыг дангаар бүрэн хариуцах;
                                \n  6.2.5. Цахим зээлийн платформд нэвтрэх нууц үгээ үрэгдүүлсэн, хулгайд алдсан, өөрийн дансанд эрх олгогдоогүй шилжүүлэг хийгдсэн тухай мэдсэн, өөрийн данстай холбоотой бүртгэлийн аливаа алдаа, зөрчил дутагдлыг илрүүлсэн болон өөрийн нууц үгийг эрх олгогдоогүй гуравдагч этгээд мэдсэн байж болзошгүй тухай сэжиглэж байвал нэн даруй нууц үгийг солих, ББСБ-д мэдээлэх;
                                \n  6.2.6. Дээрх 6.2.2-т, 6.2.5-д заасан үүргийг биелүүлээгүйн улмаас болон биелүүлсэн ч хугацаа алдсанаас үүссэн хохирлыг харилцагч өөрөө бүрэн хариуцах;
                                \n  6.2.7. Харилцагч нь өөрийн цахим зээлийн дансаа удирдахад ашиглагдах хэрэглэгчийн нэр, нууц үг болон бусад мэдээллийн нууцлалыг хадгалах, өөрийн буруутай үйл ажиллагааны улмаас зээлийн хүсэлт дээрх мөнгөн дүнг буруу оруулснаас гарах хохирол, хариуцлагыг өөрөө хүлээх;
                                \n  6.2.8. Харилцагчийн бүртгэлтэй нэвтрэх нэр, нууц үгийг ашиглан хийгдэж буй зээл авах хүсэлтийг тухайн харилцагч өөрөө гаргаж буйд тооцох; 
                                \n  6.2.9. Харилцагч нь санаатай болон санамсаргүй байдлаар Цахим зээлийн үйлчилгээний платформд үйл ажиллагааны саатал, доголдол үүсгэсэн бол түүний улмаас учирсан хохирлыг үл маргах журмаар барагдуулах;
                                \n  6.2.10. Хууль тогтоомж болон энэхүү Цахим зээлийн үйлчилгээний нөхцөлөөр хүлээсэн бусад үүрэг;
                                `}</Text>
                        </View>
                        <View style={condition.conditionContentParagraph}>
                            <Text style={condition.paragraphNum}>Долоо. ББСБ-ын эрх, үүрэг</Text>
                            <Text style={condition.paragraphText}>{`7.1. ББСБ дараах эрхтэй:
                                \n  7.1.1. Харилцагчийг хууль тогтоомж, Цахим зээлийн үйлчилгээний нѳхцѳл, Цахим зээлийн эрх нээх гэрээгээр хүлээсэн үүргээ биелүүлэх, биелүүлээгүйгээс учирсан хохирлыг барагдуулахыг шаардах, бүрэн арилгуулахаар шүүхэд нэхэмжлэл гаргах;
                                \n  7.1.2. Хууль тогтоомжид заасан эрх бүхий байгууллага шаардсан тохиолдолд Харилцагчийн холбогдох мэдээллийг хуульд заасан хүрээнд ил болгох;
                                \n  7.1.3. Харилцагчаас Цахим зээлийн эрх нээх гэрээнд зааснаар шимтгэл авах;
                                \n  7.1.4. Харилцагч хууль тогтоомж, Цахим зээлийн үйлчилгээний нѳхцѳл, Цахим зээлийн эрх нээх гэрээний шаардлагыг хангаагүй нөхцөлд Цахим зээлийн эрх нээх гэрээг цуцлах;
                                \n  7.1.5. Цахим зээлийн шимтгэлийн нөхцөлийг МУ-ын хууль тогтоомжид заасан нөхцөлийн дагуу өөрчлөх, шинэчлэн батлах;
                                \n  7.1.6. Хууль тогтоомж, Цахим зээлийн үйлчилгээний нѳхцѳл, Цахим зээлийн эрх нээх гэрээнд заасан бусад эрх;
                                \n7.2. ББСБ дараах үүрэгтэй:
                                \n  7.2.1. Харилцагчийн санал, гомдлыг ажлын 5 өдрийн дотор шийдвэрлэх, шаардлагатай бол санал, гомдлыг шийдвэрлэх хугацааг сунгах, энэ тухай Харилцагчид нэн даруй мэдэгдэх;
                                \n  7.2.2. Харилцагчид үйлчилгээний талаар заавар зөвлөгөө өгөх;
                                \n  7.2.3. Харилцагчийн мэдээллийг холбогдох хууль тогтоомж болон энэ Цахим зээлийн үйлчилгээний нөхцөлд зааснаас бусад зорилгоор ашиглахгүй байх, түүнийг чандлан нууцлах;
                                \n  7.2.4. Хэрэглэгчийн зөвшөөрөлгүй хийгдсэн цахим зээлийн хүсэлт, эсхүл хийгдсэн байж болзошгүй тухай мэдэгдлийг хэрэглэгчээс хүлээж авах, баталгаажуулах, холбогдох хууль хяналтын байгууллагаар шалгуулах арга хэмжээг авах;
                                \n  7.2.5 Цахим зээлийн үйлчилгээтэй холбоотой үнэн зөв мэдээллийг хэрэглэгчид хүргэх, шаардсан тохиолдолд мэдээлэх;
                                \n  7.2.6. Цахим зээлийн үйлчилгээний шимтгэл болон бусад төлбөр тооцоо, бүртгэлийг холбогдох журмын дагуу үнэн зөв гүйцэтгэх, гүйлгээний мэдээллийг харилцагчид цахим зээлийн платформоор эсхүл үүрэн холбооны мессеж үйлчилгээгээр дамжуулан илгээх;
                                \n  7.2.7. Хууль тогтоомж, Цахим зээлийн үйлчилгээний нѳхцѳл, Цахим зээлийн эрх нээх гэрээгээр хүлээсэн бусад үүргээ биелүүлэх;
                                `}</Text>
                        </View>
                        <View style={condition.conditionContentParagraph}>
                            <Text style={condition.paragraphNum}>Найм. Үйлчилгээний нѳхцѳлд нэмэлт, ѳѳрчлѳлт оруулах</Text>
                            <Text style={condition.paragraphText}>{`8.1. ББСБ нь энэхүү үйлчилгээний нѳхцѳлд хэдийд ч дангаар нэмэлт, ѳѳрчлѳлт оруулах эрхтэй.
                                \n8.2. ББСБ нь үйлчилгээний нѳхцѳлд нэмэлт, ѳѳрчлѳлт оруулах тухай бүрт тэр даруй Харилцагчид мэдэгдэх үүрэгтэй. Энэхүү мэдэгдлийг Харилцагчийн бүртгэлтэй и-мэйл хаяг болон цахим зээлийн платформоор дамжуулан хүргэнэ.
                                \n8.3. Харилцагч нь 8.2-т заасан мэдэгдлийг хүлээн авсан даруй платформ руу нэвтэрч, үйлчилгээний нѳхцѳлийн нэмэлт, ѳѳрчлѳлттэй танилцах үүрэгтэй.
                                \n8.4. Харилцагч нь цахим зээлийн үйлчилгээний нѳхцѳлд орсон нэмэлт ѳѳрчлѳлтийг хүлээн зѳвшѳѳрсѳн тохиолдолд тухайн нѳхцѳлѳѳр үргэлжлүүлэн цахим зээлийн үйлчилгээг авах эрхтэй;
                                \n8.5. Харилцагч нь цахим зээлийн үйлчилгээний нѳхцѳлд орсон нэмэлт, ѳѳрчлѳлтийг хүлээн зѳвшѳѳрѳѳгүй тохиолдолд ББСБ болон харилцагч хооронд дараах харилцаа үүснэ:
                                \n  8.5.1. Цахим зээлийн үйлчилгээний нѳхцѳлд нэмэлт, ѳѳрчлѳлт оруулахаас ѳмнѳ ББСБ-ын Харилцагчид олгосон зээлийн хугацаа дуустал талуудын хооронд ѳмнѳх цахим зээлийн үйлчилгээний нѳхцѳл болон тэдгээрийн хооронд байгуулсан цахим зээлийн эрх нээх гэрээ хүчин тѳгѳлдѳр үйлчилнэ;
                                \n  8.5.2. Үйлчилгээний нѳхцѳлд нэмэлт, ѳѳрчлѳлт оруулахаас ѳмнѳ Харилцагчид олгосон зээлийн хугацаа дуусаж, талууд хоорондын тѳлбѳр тооцооны асуудал дуусмагц, ББСБ нь Харилцагчтай байгуулсан Цахим зээлийн эрх нээх гэрээг цуцалж Харилцагчийн бүртгэлийг цуцална;
                                \n  8.5.3 Нэмэлт, ѳѳрчлѳлт орсон Цахим зээлийн үйлчилгээний нѳхцѳлийг зѳвшѳѳрѳѳгүй харилцагчид нь зээл авах үйлчилгээг цаашид ашиглах боломжгүй болно;  
                                \n  8.5.4 Бүртгэл цуцлагдсан харилцагч, хожим цахим зээлийн үйлчилгээний нѳхцѳлийг зѳвшѳѳрсѳн тохиолдолд дахин бүртгүүлэх боломжтой байна.
                                \n  8.6. Энэхүү цахим зээлийн үйлчилгээний нөхцөлийн Харилцагчид тавигдах шаардлага шинэчлэгдэж, өөрчлөгдсөн тохиолдолд харилцагчийн өмнө өгсөн мэдээллийг тухайн шинэчлэгдсэн шаардлагыг хангаж буй эсэхийг тогтоох зорилгоор хэрэглэхийг хүлээн зөвшөөрч байна.
                                `}</Text>
                        </View>
                        <View style={condition.conditionContentParagraph}>
                            <Text style={condition.paragraphNum}>Ес. Баталгаа</Text>
                            <Text style={condition.paragraphText}>{`9.1. Энэхүү цахим зээлийн үйлчилгээний нөхцөлийг зөвшөөрөх өдөр буюу түүнээс өмнөх хугацаанд хамрагдах ББСБ-д мэдэгдээгүй ямар нэгэн өр, төлбөр, төлбөрийн маргаан, шүүхийн процесс, үүрэг, хариуцлага байхгүйг Харилцагч үүгээр баталж байна.
                                \n9.2. Үнэн зөв мэдэгдэл, бүрэн эрх.  Энэхүү цахим зээлийн үйлчилгээний нөхцөлийн дагуу Харилцагчаас ББСБ-д гарган өгсөн бүх баримт бичиг болон Цахим зээлийн платформд харилцагчийн оруулсан мэдээлэл, баталгаа нь бүгд үнэн зөв бөгөөд ямар нэгэн чухал баримт, мэдээллийн талаар худал мэдэгдээгүй, Цахим зээлийн эрх нээх гэрээ болон Цахим зээлийн үйлчилгээний нѳхцѳл үнэн зөв болоход зайлшгүй шаардлагатай аливаа чухал баримт, мэдээллийг орхигдуулаагүй болохыг харилцагч үүгээр батлан мэдэгдэж байна. Цахим зээлийн платформ бүртгэгдсэн харилцагчийн бүх мэдээлэл нь үнэн зөв бөгөөд мэдээлэлд өөрчлөлт орсон тохиолдолд харилцагч нь ББСБ-д тухай бүр мэдэгдэхээ нотолж байна.
                                \n9.3. Нууц хадгалах. Талууд цахим зээлийн үйлчилгээний нѳхцѳлийг хүлээн зѳвшѳѳрснѳѳр нөгөө талынхаа хувийн болон бизнесийн үйл ажиллагаатай холбоотой аливаа мэдээллийг шууд буюу шууд бусаар нөгөө талдаа гэм хор учруулахаар ашиглахгүй, МУ-ын хууль тогтоомжид зааснаас бусад тохиолдолд Гуравдагч этгээдэд задруулахгүй. Харилцагч нэвтрэх нэр, нууц үгийн хадгалалт аюулгүй байдлаа өөрөө хариуцна. Энэхүү үүргийг талууд хугацаагүй хүлээнэ.
                                `}</Text>
                        </View>
                        <View style={condition.conditionContentParagraph}>
                            <Text style={condition.paragraphNum}>Арав. Гэнэтийн буюу давагдашгүй хүчин зүйл</Text>
                            <Text style={condition.paragraphText}>{`10.1. Гэнэтийн буюу давагдашгүй хүчин зүйл гэдэгт гал түймэр, газар хөдлөлт, салхи шуурга, аянга цахилгаан, үер усны гамшиг зэрэг байгалийн гамшиг, нийтийг хамарсан үймээн самуун, эмх замбараагүй байдал, ажил хаялт, эрчим хүчний тасалдал, эсэргүүцлийн хөдөлгөөн, гоц халдварт өвчин, дайн, террорист халдлага, төрийн эрх бүхий байгууллагын шийдвэр, хорио цээр, сүлжээний хэвийн ажиллагааны горимоос хэтэрсэн гэнэтийн огцом ачаалал, ханган нийлүүлэгч, эсхүл энэхүү Цахим зээлийн үйлчилгээний нөхцөлөөр үзүүлэх үйлчилгээнд оролцогч гуравдагч байгууллагын систем, сүлжээ, интернет, тог цахилгааны тасалдал зэрэг талуудын хүсэл зоригоос үл хамаарах, тэдгээрийн хяналтаас гадуур, урьдчилж тооцох ба даван туулах боломжгүй шалтгаануудыг ойлгоно.
                                \n10.2. Гэнэтийн буюу давагдашгүй хүчний шинжтэй нөхцөл байдлын улмаас Цахим зээлийн үйлчилгээний нөхцөл болон Цахим зээлийн эрх нээх гэрээгээр хүлээсэн үүргээ зохих ёсоор биелүүлэх боломжгүй болсон тохиолдолд нэн даруй нөгөө талдаа мэдэгдэнэ. Энэ тохиолдолд үүрэг гүйцэтгэх хугацаа нь энэхүү нөхцөл байдал арилах хүртэл хугацаагаар хойшлогдоно.
                                \n10.3. Гэнэтийн болон давагдашгүй хүчний шинжтэй нөхцөл байдал үүссэн тухай тодорхойлолтыг холбогдох байгууллагаас гаргуулах бөгөөд энэ тохиолдолд талууд харилцан тохиролцож асуудлыг шийдвэрлэнэ.
                                \n10.4. Гэнэтийн буюу давагдашгүй хүчин зүйлсийн улмаас Цахим зээлийн үйлчилгээний нөхцөл болон Цахим зээлийн эрх нээх гэрээний үүргээ биелүүлээгүй, эсвэл зохих ёсоор биелүүлээгүй тал нь энэ тухайгаа нотолсон тохиолдолд хариуцлагаас чөлөөлөгдөнө.
                                `}</Text>
                        </View>
                        <View style={condition.conditionContentParagraph}>
                            <Text style={condition.paragraphNum}>Арван нэг. Бусад зүйл</Text>
                            <Text style={condition.paragraphText}>{`11.1. Энэхүү Цахим зээлийн үйлчилгээний нөхцөл талуудын хооронд байгуулах Цахим зээлийн эрх нээх гэрээний салшгүй хэсэг байх бѳгѳѳд гэрээний нэгэн адил дагаж мѳрдѳнѳ.
                                \n11.2. Талуудын аль нэг нь Цахим зээлийн үйлчилгээний нөхцөл болон Цахим зээлийн эрх нээх гэрээг зөрчсөнөөс нөгөө талдаа учруулсан бодит хохирол, зардлыг буруутай тал хариуцна.
                                \n11.3. Энэхүү Цахим зээлийн үйлчилгээний нөхцөл болон Цахим зээлийн эрх нээх гэрээг хэрэгжүүлэх явцад гарах аливаа маргааныг талууд нэн түрүүнд харилцан тохиролцох, хэлэлцээр хийх замаар шийдвэрлэнэ. Тохиролцооны замаар шийдвэрлэж чадаагүй бол маргааныг эрх бүхий байгууллага эсхүл харьяалах шүүхээр шийдвэрлүүлнэ.
                                \n11.4. Цахим зээлийн эрх нээх гэрээ болон Цахим зээлийн эрх нээх гэрээнд холбогдох баримт бичгийг нотариатаар гэрчлүүлэх тохиолдолд зардлыг Харилцагч хариуцан тѳлнѳ. 
                                \n11.5. Харилцагч нь цахим зээлийн үйлчилгээний нөхцөлийг хүлээн зөвшөөрснөөр ББСБ нь харилцагчийн Зээлийн мэдээллийн сангийн лавлагааг авах эрхтэй болох ба харилцагчтай Цахим зээлийн эрх нээх гэрээ байгуулах үед ББСБ нь дахин гарын үсэг зурж баталгаажуулна.
                                \n11.6. Харилцагч энэхүү цахим зээлийн үйлчилгээний нөхцөлийг зөвшөөрснөөр Харилцагчид зээл олгох үндэслэл болно гэж үзэхгүй бөгөөд Харилцагч цахим зээлийн эрх нээх гэрээг ББСБ-ын эрх бүхий ажилтантай өөрийн биеэр байгуулснаар харилцагчийн зээл авах эрх үүснэ.
                                \n11.7. ББСБ-аас Кю-мони цахим зээлийн платформоор дамжуулан хүргүүлсэн аливаа мэдэгдэл, цахим зээлийн үйлчилгээний нөхцөлийн нэмэлт, өөрчлөлтүүдийг Харилцагч нь цахим зээлийн платформоор дамжуулан зөвшөөрсөн нь тухайн мэдэгдэл, цахим зээлийн үйлчилгээний нөхцөлийн нэмэлт, өөрчлөлтийг энэхүү баримт бичгийн нэгэн адил хүлээн зөвшөөрсөнд тооцогдоно.
                                \n11.8. Цахим зээлийн үйлчилгээний нөхцөл болон Цахим зээлийн эрх нээх гэрээ нь Монгол Улсын хууль тогтоомжийн дагуу зохицуулагдана.
                                `}</Text>
                        </View>
                        <View style={condition.conditionContentParagraph}>
                            <Text style={condition.paragraphNum}>САНУУЛГА</Text>
                            <Text style={condition.paragraphText}>{`Энэхүү цахим зээлийн үйлчилгээний нөхцөл нь Харилцагч Монголиа Импакт Финанс ББСБ ХХК-иас Кю-мони цахим зээлийн платформоор дамжуулан цахим зээлийн үйлчилгээ авахтай холбоотойгоор талуудын хоорондын харилцааг зохицуулах суурь баримт бичиг болно. Цахим зээлийн үйлчилгээний нөхцөл нь Кю-мони цахим зээлийн платформ Харилцагчийн үүсгэсэн, илгээсэн тодорхой мэдээллийг хадгалах, уг цахим зээлийн үйлчилгээний нѳхцѳлд заасан зорилгоор ашиглах, түүнд боловсруулалт хийх эрхийг олгох эрх зүйн үр дагавар бүхий хууль зүйн баримт бичиг юм. Кю-мони цахим зээлийн платформын зүгээс харилцагчийн бүртгүүлсэн гар утсанд илгээх 6 оронтой баталгаажуулах кодыг баталгаажуулах код хэсэгт оруулан үйлчилгээний нѳхцѳлтэй танилцан зѳвшѳѳрѳх товчыг дарснаар харилцагч уг цахим зээлийн үйлчилгээний нөхцөлийг хүлээн зөвшөөрч гарын үсэг зурсан гэж үзнэ.`}</Text>
                            <View style={{ height: 20, width: '100%' }} />
                        </View>
                    </View>
                    <View style={{ width: '100%', alignItems: 'center', marginBottom: 20 }}>
                        <View style={MainStyle.btnWidth50}>
                            <TouchableOpacity
                                style={[MainStyle.buttonBorder, { marginRight: 10, width: 160 }]}
                                onPress={() => tocHandler(false)}>
                                <Text style={MainStyle.btnTextGray}>Татгалзах</Text>
                            </TouchableOpacity>
                            <TouchableOpacity style={[MainStyle.buttonPurple, { width: 160 }]}
                                onPress={() => tocHandler(true)}>
                                <Text style={MainStyle.btnTextLight}>Зөвшөөрөх</Text>
                            </TouchableOpacity>
                        </View>
                    </View>
                </ScrollView>
            </View>
            {/* <View style={{ position: 'absolute', bottom: 10, width: '100%', alignItems: 'center' }}>
                    <View style={mainStyle.btnWidth50}>
                        <TouchableOpacity
                            style={[mainStyle.buttonBorder, { marginRight: 10, width: 160 }]}
                            onPress={() => this.props.tocHandler(false)}>
                            <Text style={mainStyle.btnTextGray}>Татгалзах</Text>
                        </TouchableOpacity>
                        <TouchableOpacity style={[mainStyle.buttonPurple, { width: 160 }]}
                            onPress={() => this.props.tocHandler(true)}>
                            <Text style={mainStyle.btnTextLight}>Зөвшөөрөх</Text>
                        </TouchableOpacity>
                    </View>
                </View> */}
        </View>
    );
}

const condition = StyleSheet.create({
    container: {
        flex: 1,
        justifyContent: 'center',
        width: '100%',
        alignItems: 'center',
        backgroundColor: '#ffffff',
    },
    conditionContent: {
        marginTop: 50,
        paddingTop: 20,
        // paddingBottom: 80,
    },
    conditionContentParagraph: {
        marginTop: 15,
        alignItems: 'flex-start'
    },
    contentContainer: {
        paddingHorizontal: 20,
        paddingVertical: 20,
    },
    paragraphNum: {
        marginBottom: 10,
        marginRight: 15
    },
    paragraphText: {
        fontSize: 12,
        lineHeight: 14,
        color: '#333'
    },
    subParagraphText: {
        fontSize: 14,
        lineHeight: 22
    },
});